cookbook.org
:PROPERTIES:
#+STARTUP: overview inlineimages
#+TAGS: @baking @breakfast @entree @side @soup @stew @sauce @dressing
#+TAGS: GF(g)
#+OPTIONS: toc:nil
#+HUGO_BASE_DIR: /home/trevdev/Projects/os-cookbook/
#+HUGO_SECTION: recipe
#+HUGO_AUTO_SET_LASTMOD: t
#+HUGO_FRONT_MATTER_FORMAT: yaml
:END:
#+TITLE: Open Source Cookbook
#+AUTHOR: "Trev"
** Butternut Squash Soup                                             :@soup:
:PROPERTIES:
:export_file_name: butternut-squash-soup
:export_hugo_custom_front_matter: :servings 4
:export_hugo_custom_front_matter+: :prep-time 20
:export_hugo_custom_front_matter+: :cook-time 45
:export_hugo_custom_front_matter+: :ready-in 65
:export_hugo_custom_front_matter+: :source-url https://www.allrecipes.com/recipe/77981/butternut-squash-soup-ii/
:END:
*** Ingredients

- 2 tablespoons butter
- 1 small onion, chopped
- 1 stalk celery, chopped
- 1 medium carrot, chopped
- 2 medium potatoes, cubed
- 1 medium butternut squash - peeled, seeded, and cubed
- 1 (32 fluid ounce) container chicken stock
- salt and freshly ground black pepper to taste

*** Directions

1. Melt butter in a large pot over medium heat, and cook onion, celery, carrot, potatoes, and squash until lightly browned, about 5 minutes. Pour in enough of the chicken stock to cover vegetables.
2. Bring to a boil over medium-high heat. Reduce heat to low, cover pot, and simmer until all vegetables are tender, about 40 minutes.
3. Transfer the soup to a blender, and blend until smooth. Return to the pot, and mix in any remaining stock to reach desired consistency. Season with salt and pepper.

