content/recipe/butternut-squash-soup.md
---
title: "Butternut Squash Soup"
author: ["Trev"]
lastmod: 2022-05-30T11:03:40-07:00
categories: ["soup"]
draft: false
servings: 4
prep-time: 20
cook-time: 45
ready-in: 65
source-url: "https://www.allrecipes.com/recipe/77981/butternut-squash-soup-ii/"
---

## Ingredients {#ingredients}

-   2 tablespoons butter
-   1 small onion, chopped
-   1 stalk celery, chopped
-   1 medium carrot, chopped
-   2 medium potatoes, cubed
-   1 medium butternut squash - peeled, seeded, and cubed
-   1 (32 fluid ounce) container chicken stock
-   salt and freshly ground black pepper to taste


## Directions {#directions}

1.  Melt butter in a large pot over medium heat, and cook onion, celery, carrot, potatoes, and squash until lightly browned, about 5 minutes. Pour in enough of the chicken stock to cover vegetables.
2.  Bring to a boil over medium-high heat. Reduce heat to low, cover pot, and simmer until all vegetables are tender, about 40 minutes.
3.  Transfer the soup to a blender, and blend until smooth. Return to the pot, and mix in any remaining stock to reach desired consistency. Season with salt and pepper.